package houmwork1302;

import java.util.Scanner;

public class Task_2 {
    public static void main(String[] args) {
        //вывести числа которые являются положительными и кратными числу, которое ввел пользователь.
        // Вывести количество совпадений
   //     Scanner scanner = new Scanner();
   //     System.out.println("Enter number: ");

   //     int [] array = new


    }
}
