package lesson1.aq;

public class Houm5a {
    public static void main(String[] args) {
        //вычислить: 1+2+4+8+...+256
//        int i = 1;
//        int sum=0;
//        for (i=1; i<=128; i*=2)
//         {
//             sum=sum+i*2;
//        }
//         System.out.println(sum);
//
//        //напишите программу вывода всех четных чисел от 2 до 100 включительно
//        int x=2;
//        for (x=2;x<=100;x+=2)
//        {
//            System.out.println(x);
//        }

// напишите программу, определяющую сумму всех нечетных чисел от 1 до 99

//        int i=1;
//        int sum=0;
//        for (i=1;i<99;i+=2)
//            sum=sum+i;
//        {
//            System.out.println(sum);
//        }
// Даны числа от 0 до 100.
//        - посчитать сумму четных и вывести на экран
//        int i=2;
//        int sum=0;
//        for (i=2;i<=100;i+=2)
//        sum=sum+i;
//        {
//            System.out.println(sum);
//        }
        // - посчитать сумму нечетных и вывести на экран
//        int i=1;
//        int sum=0;
//        for (i=1;i<100;i+=2)
//            sum=sum+i;
//        {
//            System.out.println(sum);
//        }
//      найти общую сумму всех чисел
    int i=1;
    int sum=0;
    for (i=1;i<100;i++)
        sum=sum+i;
        {
            System.out.println(sum);
        }
            }
        }








